# Git - это распределенная система контроля версий.
# Это система для отслеживания и введения истории изменения файлов,  в вашеи проекте.

# Репозиторий - это хранилище вашего кода  и истории его изменения.

# GitHub - вебсайт для размещени git- репозиториев и совместной разработки проектов.

# # Команы Git:

# git init - Она создвет новый git репозиторий  локально на вашем пк

# git commmit - как только мы достигаем определенного момента в разработка, то тогда 
# мы сохраняем  и коментируем наши изменения

# git commit -m '<коммент>'

# git branch - Ветки очень важны в git. При помощи веток несколько программистов могут работать 
# парралельно на одном и том же проетке.При помощи git branch мы можем создать, просматривать или удалять ветки.

# Создание ветки: git branch <название ветки>
# Просмотр веток: git branch or git branch --list

# Удаление: git branch - d <название ветки> 

# git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием(репо в гитхаб).
# git remote add <название подключение>
# <ссылка на репозиторий>

# git add - когда мы создаем или изменяем файлы,при помощи этой команды мы загружаем все изменения в локальное хранилище.

# git add <название файла>
# git add  .

# git push - после коммита изменений  при помощи этой команды мы отпраляем наши изменени на удаленный репозиторий 

# git status  - команда которая выдает нам всю информацию о наших файлах.

# git checkout - команда используется для работы в команде , она помогает переключаться по веткам.

# git checkout <